import { useEffect, useState } from "react";

function Documentation() {

    const [loaded, setLoaded] = useState(false);

    useEffect(() => {
        setLoaded(true);
    }, []);

    return (
        <div>
            {
                loaded ?
                    (
                        <div className="container" style={{ marginTop: '100px', paddingBottom: '35px' }}>
                            <nav aria-label="breadcrumb">
                                <ol class="breadcrumb">
                                    <li class="breadcrumb-item"><a className='text-dark' style={{ textDecoration: "none" }} href="/home">Дома</a></li>
                                    <li class="breadcrumb-item active" aria-current="page">Упатство</li>
                                </ol>
                            </nav>
                            <div className="row justify-content-center">
                                <div className="col-md-12 p-4 rounded" style={{ backgroundColor: "#C9F0B0" }}>
                                    <h1 className="text-center mb-5">Кратко упатство за употреба</h1>
                                    <hr/>
                                    <p className="fs-4 mb-5 text-center">
                                        <i class="bi bi-info-circle"></i> Ова претставува кратко упатство кое треба да ве воведе во главните функционалности на страницата.
                                    </p>
                                    <h3>1. Сите растенија</h3>
                                    <p className="ms-5">
                                        Во делот "Сите растенија" можете, всушност, да ги најдете сите видови на растенија. Откако ќе ја изберете 
                                        посакуваната категорија на растение, ќе ви биде прикажана листа од растенија кои припаѓаат на соодветната
                                        категорија.
                                    </p>
                                    <h3>2. Конкретно растение</h3>
                                    <p className="ms-5">
                                        Откако ќе го пронајдете соодветното растение од бараната категорија, ќе ви бидат прикажани следните информации:
                                        <ul>
                                            <li>Опис - краток опис за растението.</li>
                                            <li>Предуслови - потребни предуслови кои треба да се задоволат пред да го садите растението. Потребен алат, место за садење, супстрат итн.</li>
                                            <li>Садење - упатство како се сади растението.</li>
                                            <li>Одржување - совети како треба да се одржува растението и потребни ресурси доколку постојат.</li>
                                        </ul>
                                    </p>
                                    <h3>3. Коментари</h3>
                                    <p className="ms-5">
                                        На страницата на секое поединечно растение во долниот дел има простор за оставање коментари, совети и проблеми.
                                        <br/>
                                        <b className="text-danger">Напомена:</b> За да оставите коментар мора да имате кориснички профил и да сте најавени.
                                    </p>
                                    <h3>4. Квизови</h3>
                                    <p className="ms-5">
                                        <p>
                                            За одредени растенија постојат мини квизови со кои можете да си го проверите вашето знаење. Секој квиз се состои
                                            од неколку прашања со понудени одговори.
                                        </p>
                                        <p>
                                            Темите се секогаш конкретното растение за кое се однесува квизот.
                                        </p>
                                        <p>
                                            Доколку одговорите точно на <u>барем половина од прашањата</u> од квизот, ќе ви биде доделен "беџ" кој означува дека
                                            го имате положено квизот. Вашите освоени беџови можете да ги видите на вашиот кориснички профил.
                                        </p>
                                        <b className="text-danger">Напомена:</b> За да решавате квиз мора да имате кориснички профил и да сте најавени.
                                    </p>
                                </div>
                            </div>
                        </div>
                    )
                    :
                    (
                        <div className="spinner">

                        </div>
                    )
            }
            </div>
    );
}

export default Documentation;